---
kind: property
id: P:Autodesk.Revit.DB.WallSweepInfo.WallSide
source: html/d69280c8-7e5c-fc50-0c70-3e3145096329.htm
---
# Autodesk.Revit.DB.WallSweepInfo.WallSide Property

The side of the wall to which the sweep or reveal is attached.

## Syntax (C#)
```csharp
public WallSide WallSide { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration